content/posts/20250424-pta-emacs2/index.md
+++
title = "Plain Text Accounting with Emacs – Part 2"
featuredImage = "20250424-share_trading.png"
date = 2025-04-24
lastmod = 2025-04-25T20:22:15+10:00
tags = ["PlainTextAccounting", "Emacs"]
categories = ["Blog"]
draft = false
weight = 3001
author = "Matt Maguire"
+++

Following up from my [previous article]({{< relref "index.md" >}}) on using Emacs to maintain a plain-text ledger for use with plain text accounting software: I reconfigured my Doom Emacs to use the pre-packaged Ledger mode, and I can confirm that it is much nicer to use than the hledger mode I was using before. This could be because I hadn't set up the `hledger-mode` configuration properly, but with `ledger-mode` I find the autocompletion works much better, and the `M-q` keystroke can be used to nicely line up the amounts in a transaction.

I mentioned last time that I would talk a bit more about doing share trades, so I'll cover that in this article.


## Buying shares {#buying-shares}

When you buy shares, it is important to record the price at which you purchased that lot of shares so that you can correctly calculate capital gains (or losses) at the time you sell them. With HLedger, this is most easily achieved by specifying a subaccount when you purchase a group of shares. For example, lets say I purchased 100 Woolworths shares for $29.55 each on 2 April, 2025. I would create a transaction in my journal like this:

```ledger
2025-04-02 Buy 100 WOW @ $29.55
    assets:shares:WOW:20250402#1           100 WOW @ $29.55
    expenses:brokerage                   $9.95
    liabilities:payable:sharetrades
```

The code `20250402#1` identifies the first lot of shares I bought on 2 April 2025. Maybe the shares come down in price later that day, and I decide to buy 50 more. Then I would create the follow transaction for that next purchase.

```ledger
2025-04-02
   assets:shares:WOW:20250402#2             50 WOW @ $28.50
    expenses:brokerage                   $9.95
    liabilities:payable:sharetrades
```

So, now that I've made those purchaes, let's check out my balance sheet

```text
$ hledger bs
Balance Sheet 2025-04-02

                                 ||          2025-04-02
=================================++=====================
 Assets                          ||
---------------------------------++---------------------
 assets:bank:savings             ||          $10,000.00
 assets:shares:WOW:20250402#1    ||             100 WOW
 assets:shares:WOW:20250402#2    ||              50 WOW
---------------------------------++---------------------
                                 || $10,000.00, 150 WOW
=================================++=====================
 Liabilities                     ||
---------------------------------++---------------------
 liabilities:payable:sharetrades ||           $4,399.90
---------------------------------++---------------------
                                 ||           $4,399.90
=================================++=====================
 Net:                            ||  $5,600.10, 150 WOW
```

So, I have \\(\\$10,000\\) in my savings account, and I am the proud owner of two share lots totaling 150 WOW shares. Well, maybe I speak too soon -- I haven't paid for the shares yet. You can see under Liabilities that I owe my broker \\(\\$4,399.90\\) for the shares plus his brokerage fee. The broker is going to expect that I settle this debt on the second business day after the purchase. We'll get to that in a minute. For now, maybe I want to see how much each share lot cost me in dollars. I can do this using the `-B` option on the hledger command:

```text
$ hledger bs -B
Balance Sheet 2025-04-02, converted to cost

                                 || 2025-04-02
=================================++============
 Assets                          ||
---------------------------------++------------
 assets:bank:savings             || $10,000.00
 assets:shares:WOW:20250402#1    ||  $2,955.00
 assets:shares:WOW:20250402#2    ||  $1,425.00
---------------------------------++------------
                                 || $14,380.00
=================================++============
 Liabilities                     ||
---------------------------------++------------
 liabilities:payable:sharetrades ||  $4,399.90
---------------------------------++------------
                                 ||  $4,399.90
=================================++============
 Net:                            ||  $9,980.10
```

So now I can see how much I paid for each lot. What if I don't care about lots -- I just want to see how much I paid for my Woolworth shares in total. You can hide the lot numbers by saying I only want account names to go to three levels, and that everything below that should be totalled up and summarized. I then see:

```text
$ hledger bs -B -3
Balance Sheet 2025-04-02, converted to cost

                                 || 2025-04-02
=================================++============
 Assets                          ||
---------------------------------++------------
 assets:bank:savings             || $10,000.00
 assets:shares:WOW               ||  $4,380.00
---------------------------------++------------
                                 || $14,380.00
=================================++============
 Liabilities                     ||
---------------------------------++------------
 liabilities:payable:sharetrades ||  $4,399.90
---------------------------------++------------
                                 ||  $4,399.90
=================================++============
 Net:                            ||  $9,980.10
```

So now you can see I own \\(\\$4,380\\) worth of shares, and I owe my broker \\(\\$4,399.90\\). What happened to the brokerage fee? Well, that is an expense, and so it won't appear on the balance sheet. I need to look at an income statement to find it:

```text
$ hledger is
Income Statement 2025-04-01..2025-04-02

                    || 2025-04-01..2025-04-02
====================++========================
 Revenues           ||
--------------------++------------------------
--------------------++------------------------
                    ||
====================++========================
 Expenses           ||
--------------------++------------------------
 expenses:brokerage ||                 $19.90
--------------------++------------------------
                    ||                 $19.90
====================++========================
 Net:               ||                $-19.90
```

Oh dear, I've spent \\(\\$19.90\\) on brokerage fees, but I haven't earned any money yet. So, I am \\(\\$19.90\\) in the hole.

I don't want to get into any more trouble by not paying the broker's bill, so let's create a new transaction where I settle the bill:

```ledger
2025-04-04 ! Settlement for WOW share purchase
    liabilities:payable:sharetrades  $4399.90
    assets:bank:savings
```

After settling my trade, let's take another look at my balance sheet:

```text
$ hledger bs -B -3
Balance Sheet 2025-04-04, converted to cost

                     || 2025-04-04
=====================++============
 Assets              ||
---------------------++------------
 assets:bank:savings ||  $5,600.10
 assets:shares:WOW   ||  $4,380.00
---------------------++------------
                     ||  $9,980.10
=====================++============
 Liabilities         ||
---------------------++------------
---------------------++------------
                     ||
=====================++============
 Net:                ||  $9,980.10
```

So now my savings account has gone down, but I don't have any debt to my broker anymore.

The reason I wanted to buy the shares was to make some money, so let's see how to do that.
