content/posts/20250424-pta-emacs2/index.md


## Booking Dividends {#booking-dividends}

One way to make money from shares is to receive dividends. This is very easy to record in my ledger:

```ledger

2025-05-01 WOW dividend
    revenues:shares:wow  $-35
    assets:bank:savings
```

So, I receive some revenue from Woolworths by way of a dividend -- because paying me a dividend causes Woolworths to have less money, the revenue shows as negative. To balance the transaction, positive \\(\\$35\\) is added to my savings account -- score! Let's check my inocme statement again:

```text
$ hledger is
Income Statement 2025-04-01..2025-05-01

                     || 2025-04-01..2025-05-01
=====================++========================
 Revenues            ||
---------------------++------------------------
 revenues:shares:WOW ||                 $35.00
---------------------++------------------------
                     ||                 $35.00
=====================++========================
 Expenses            ||
---------------------++------------------------
 expenses:brokerage  ||                 $19.90
---------------------++------------------------
                     ||                 $19.90
=====================++========================
 Net:                ||                 $15.10
```

Now I'm in the black! The dividend payment has covered the brokerage fees, and I'm now \\(\\$15.10\\) ahead.

Let's see if I can make any more money by selling some shares
