content-org/posts.org
**** Selling Shares

The other way to make money off shares is through capital gains, which means you sell the shares for more than you paid for them. So, let's say that at the end of may, the market price for my shares is \(\$32\). I can let hledger know this using a =P= directive:

#+begin_src ledger
P 2025-05-31 WOW $32.00
#+end_src

So, what is my portfolio now worth? To find out, we apply the =-V= option to my balance sheet. If I'm only interested in the value of my shares and not my bank account, I can add a filter "shares" so that only assets containing that word are shown in the balance sheet.

#+begin_example
$ hledger bs shares -V
Balance Sheet 2025-05-31, valued at period ends

                              || 2025-05-31
==============================++============
 Assets                       ||
------------------------------++------------
 assets:shares:WOW:20250402#1 ||  $3,200.00
 assets:shares:WOW:20250402#2 ||  $1,600.00
------------------------------++------------
                              ||  $4,800.00
==============================++============
 Liabilities                  ||
------------------------------++------------
------------------------------++------------
                              ||
==============================++============
 Net:                         ||  $4,800.00
#+end_example

Great, I paid \(\$4,380\) for my shares, but now they are worth \(\$4,800\)! Using the =--gain= option on my balance sheet, I can see how much the shares have gone up or down in value:

#+begin_example
$ hledger bs --gain
Balance Sheet 2025-05-31 (Historical Gain), valued at period ends

                              || 2025-05-31
==============================++============
 Assets                       ||
------------------------------++------------
 assets:shares:WOW:20250402#1 ||    $245.00
 assets:shares:WOW:20250402#2 ||    $175.00
------------------------------++------------
                              ||    $420.00
==============================++============
 Liabilities                  ||
------------------------------++------------
------------------------------++------------
                              ||
==============================++============
 Net:                         ||    $420.00
#+end_example

You can also make reports that show the change in value over time, but for now I just want to make a quick profit. Unfortunately with hledger, the handling of capital gain is a bit manual. This is one way to do it:

#+begin_src ledger
2025-06-01 Sell all WOW shares
    assets:shares:WOW:20250402#1                -100 WOW @ $29.55
    assets:shares:WOW:20250402#2                 -50 WOW @ $28.50
    revenues:shares:capital_gain               -$420
    expenses:brokerage                         $9.95
    assets:receivable:sharetrades
#+end_src

So here, I reduce my share holdings back down to zero, and I declare the capital gain as a revenue. I have to pay a brokerage fee, which I declare as an expense, and so now the share broker owes me some money which I booked as an receivables asset =assets:recelvable:sharetrades=. Let's check the balance sheet again:

#+begin_example
$ hledger bs
Balance Sheet 2025-06-01

                               || 2025-06-01
===============================++============
 Assets                        ||
-------------------------------++------------
 assets:bank:savings           ||  $5,635.10
 assets:receivable:sharetrades ||  $4,790.05
-------------------------------++------------
                               || $10,425.15
===============================++============
 Liabilities                   ||
-------------------------------++------------
-------------------------------++------------
                               ||
===============================++============
 Net:                          || $10,425.15
#+end_example

You can see I no longer own any shares, but I do have \(\$4,790.05\) owing to me from the broker \(\$4,800\) from the sale of shares less the \(\$9.95\) brokerage fee). In two day's time, the broker will settle the account:

#+begin_src ledger
2025-06-02 Receive payment from broker
    assets:receivable:sharetrades          -$4790.05
    assets:bank:savings
#+end_src

The amount the broker owes me goes down by \(\$4790.05\), which means my bank account should go up by \(\$4,790.05\) to balance the transaction.

The final balance sheet now looks like this:

#+begin_example
$ hledger bs
Balance Sheet 2025-06-03

                     || 2025-06-03
=====================++============
 Assets              ||
---------------------++------------
 assets:bank:savings || $10,425.15
---------------------++------------
                     || $10,425.15
=====================++============
 Liabilities         ||
---------------------++------------
---------------------++------------
                     ||
=====================++============
 Net:                || $10,425.15
#+end_example

So, I started with \(\$10,000\) in by bank account, and now I have \(\$10,425.15\), a profit of \(\$425.15\). We can also see this on my income statement:

#+begin_example
$ hledger is
Income Statement 2025-04-01..2025-06-03

                              || 2025-04-01..2025-06-03
==============================++========================
 Revenues                     ||
------------------------------++------------------------
 revenues:shares:WOW          ||                 $35.00
 revenues:shares:capital_gain ||                $420.00
------------------------------++------------------------
                              ||                $455.00
==============================++========================
 Expenses                     ||
------------------------------++------------------------
 expenses:brokerage           ||                 $29.85
------------------------------++------------------------
                              ||                 $29.85
==============================++========================
 Net:                         ||                $425.15
#+end_example

Of course, the tax man will want his cut at the end of the year. However, you can see that I now conveniently have all the information I will need to give to my accountant at Year End.

If I wanted to do a breakdown of all the brokerage fees I paid over the year, I can use HLedger's =reg= report:

#+begin_example
$ hledger reg brokerage
2025-04-02 Buy 100 WOW @ $29.55                     expenses:brokerage             $9.95         $9.95
2025-04-02 Buy 50 WOW @ $28.50                      expenses:brokerage             $9.95        $19.90
2025-06-01 Sell all WOW shares                      expenses:brokerage             $9.95        $29.85
#+end_example

It shows the date, transaction description, transaction amount and running total for the records shown. I can check that the transactions on my savings bank account match the statement from my bank:

#+begin_example
$ hledger reg savings
2025-04-01 Opening Balances                       assets:bank:savings         $10,000.00    $10,000.00
2025-04-04 Settlement for WOW share purchase      assets:bank:savings         $-4,399.90     $5,600.10
2025-05-01 WOW dividend                           assets:bank:savings             $35.00     $5,635.10
2025-06-03 Receive payment from broker            assets:bank:savings          $4,790.05    $10,425.15
#+end_example

**** Conclusion

So, this has been a quick walk-through of how you can use plain text accounting to manage your share trading, and make sure you stay on the right side of both the tax man and your broker. Perhaps next time I'll show what happens if you buy a big ticket item for work, such as a laptop, and you need to depreciate the cost over a few years for tax purposes.

