content/posts/20250424-pta-emacs2/index.md


## Complete Ledger File {#complete-ledger-file}

If you want the complete ledger file I used for this example (so you can play around with it), you can find it below. There is a bit at the start that I didn't talk about:

-   the `commodity` directive tells HLedger how to format the currency. If you use commas as a decimal separator and periods as thousands separators, you can simply change that line.
-   The initial transaction sets up an initial balance in my savings account of \\(\\$10,000\\). Because money can't come from nowhere, and the transaction has to balance, I am pulling the \\(\\$10,000\\) out of an equity account, showing how much I invested at the start. If I close the books, the assets are all converted back to equity, and you can then see how much I will pocket in the end.

<!--listend-->

```ledger
commodity $1,000.00

2025-04-01 Opening Balances
    assets:bank:savings                    $10000.00
    equity:opening/closing balances

2025-04-02 Buy 100 WOW @ $29.55
    assets:shares:WOW:20250402#1                 100 WOW @ $29.55
    expenses:brokerage                         $9.95
    liabilities:payable:sharetrades

2025-04-02 Buy 50 WOW @ $28.50
    assets:shares:WOW:20250402#2                  50 WOW @ $28.50
    expenses:brokerage                         $9.95
    liabilities:payable:sharetrades

2025-04-04 * Settlement for WOW share purchase
    liabilities:payable:sharetrades         $4399.90
    assets:bank:savings

2025-05-01 WOW dividend
    revenues:shares:WOW                         $-35
    assets:bank:savings

P 2025-05-31 WOW $32.00

2025-06-01 Sell all WOW shares
    assets:shares:WOW:20250402#1                -100 WOW @ $29.55
    assets:shares:WOW:20250402#2                 -50 WOW @ $28.50
    revenues:shares:capital_gain               -$420
    expenses:brokerage                         $9.95
    assets:receivable:sharetrades

2025-06-03 Receive payment from broker
    assets:receivable:sharetrades          -$4790.05
    assets:bank:savings
```
